[{"id":886,"name":"油脂加工品","vegetarian":"true","created_at":"2024-03-06T12:46:24.125Z","updated_at":"2024-03-06T12:46:26.460Z","vegan":"true","english_name":"processed fats and oils","english_description":"Processed fats and oils are typically extracted from plant or animal sources using chemical solvents and refining processes, which may involve animal-derived ingredients or cross-contamination with allergens like peanuts. This production method can make processed fats and oils not suitable for vegetarians, pescetarians, and those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":887,"name":"カラメル色素","vegetarian":"true","created_at":"2024-03-06T12:46:27.407Z","updated_at":"2024-03-06T12:46:29.225Z","vegan":"true","english_name":"caramel coloring","english_description":"Caramel coloring is produced by heating sugar or other carbohydrates until they caramelize, resulting in a dark brown liquid that is used as a food coloring agent.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":890,"name":"乳化剤","vegetarian":"true","created_at":"2024-03-06T12:46:41.547Z","updated_at":"2024-03-06T12:46:44.686Z","vegan":"can-be","english_name":"emulsifier","english_description":"Emulsifier is typically produced from animal fats or oils, making it not suitable for vegans, vegetarians, or pescetarians. Additionally, it may contain traces of peanuts or dairy products, making it unsuitable for those with allergies to these ingredients.","pescetarian":"true","dairy_free":"can-be","peanut_free":"can-be"},{"id":888,"name":"酸味料","vegetarian":"can-be","created_at":"2024-03-06T12:46:30.307Z","updated_at":"2024-03-06T12:46:34.551Z","vegan":"can-be","english_name":"acidifier","english_description":"Acidifier is typically produced through the fermentation of animal-derived substances, such as gelatin or fish bones, which may make it not suitable for vegans, vegetarians, pescetarians, and those with peanut or dairy allergies.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":889,"name":"卵","vegetarian":"false","created_at":"2024-03-06T12:46:36.083Z","updated_at":"2024-03-06T12:46:39.542Z","vegan":"false","english_name":"egg","english_description":"Eggs are produced by female chickens through a process of ovulation and laying eggs, which involves the exploitation and confinement of hens in factory farms, making it not vegan.","pescetarian":"false","dairy_free":"true","peanut_free":"true"},{"id":892,"name":"イーストフード","vegetarian":"true","created_at":"2024-03-06T12:46:50.788Z","updated_at":"2024-03-06T12:46:53.799Z","vegan":"true","english_name":"yeast food","english_description":"Yeast food is produced through the fermentation of sugars by yeast, which is a living organism. This process may not be considered vegetarian or pescetarian as it involves the use of animal-derived ingredients such as gelatin or fish products. Additionally, yeast food may not be peanut-free as it can be produced in facilities that also process peanuts, leading to potential cross-contamination.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":891,"name":"香料","vegetarian":"can-be","created_at":"2024-03-06T12:46:45.873Z","updated_at":"2024-03-06T12:46:49.703Z","vegan":"can-be","english_name":"spice","english_description":"Spice is produced by grinding or drying plant parts such as seeds, bark, roots, or fruits, which may come into contact with non-vegan, non-vegetarian, non-pescetarian, peanut, or dairy ingredients during processing, making it potentially unsuitable for those dietary restrictions.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":873,"name":"砂糖","vegetarian":"true","created_at":"2024-03-06T12:45:31.571Z","updated_at":"2024-03-06T12:45:33.723Z","vegan":"true","english_name":"sugar","english_description":"Sugar is produced through the extraction of juice from sugar cane or sugar beets, which is then processed and refined to remove impurities and crystallize into granulated sugar.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":876,"name":"カレー粉","vegetarian":"true","created_at":"2024-03-06T12:45:43.012Z","updated_at":"2024-03-06T12:45:46.295Z","vegan":"true","english_name":"curry powder","english_description":"Curry powder is typically made by grinding together a blend of spices, which can include ingredients like turmeric, cumin, coriander, and fenugreek. Some curry powders may also contain non-vegetarian ingredients like dried shrimp or fish, making them unsuitable for vegetarians and pescetarians. Additionally, some curry powders may be processed in facilities that also handle peanuts, posing a risk for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":874,"name":"食塩","vegetarian":"true","created_at":"2024-03-06T12:45:35.009Z","updated_at":"2024-03-06T12:45:37.102Z","vegan":"true","english_name":"salt","english_description":"Salt is typically produced through the evaporation of seawater or the mining of underground salt deposits. The salt is then processed and refined before being packaged for sale.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":875,"name":"発酵風味料","vegetarian":"true","created_at":"2024-03-06T12:45:38.169Z","updated_at":"2024-03-06T12:45:41.950Z","vegan":"can-be","english_name":"fermented flavorings","english_description":"Fermented flavorings are produced through the process of fermentation, which often involves the use of animal-derived ingredients such as fish sauce, dairy products, or peanuts, making it unsuitable for vegans, vegetarians, pescetarians, those with peanut allergies, and individuals avoiding dairy products.","pescetarian":"true","dairy_free":"can-be","peanut_free":"can-be"},{"id":877,"name":"マーガリン","vegetarian":"true","created_at":"2024-03-06T12:45:47.441Z","updated_at":"2024-03-06T12:45:50.243Z","vegan":"true","english_name":"margarine","english_description":"Margarine is typically made from vegetable oils that are hydrogenated to create a solid spread. However, some margarines may contain animal-derived ingredients such as whey or gelatin, making them not suitable for vegetarians or pescetarians. Additionally, some margarines may be processed in facilities that also handle peanuts, posing a risk for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":878,"name":"でん粉","vegetarian":"true","created_at":"2024-03-06T12:45:53.621Z","updated_at":"2024-03-06T12:45:55.842Z","vegan":"true","english_name":"starch","english_description":"Starch is produced through the process of photosynthesis in plants, where glucose molecules are linked together to form long chains of starch molecules stored in the plant's cells.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":879,"name":"酵母エキス","vegetarian":"true","created_at":"2024-03-06T12:45:56.837Z","updated_at":"2024-03-06T12:45:59.119Z","vegan":"true","english_name":"yeast extract","english_description":"Yeast extract is produced by breaking down yeast cells through a process of autolysis, where enzymes break down the cell walls and release the contents, which are then concentrated and dried to create a savory flavoring agent.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":880,"name":"香辛料","vegetarian":"true","created_at":"2024-03-06T12:46:00.065Z","updated_at":"2024-03-06T12:46:03.050Z","vegan":"true","english_name":"spices","english_description":"Spices are typically derived from plant sources such as seeds, fruits, roots, or bark, making them vegetarian and pescetarian-friendly. However, some spice blends may contain additives or fillers that are not vegetarian or pescetarian, and some spices may be processed in facilities that also handle peanuts, making them potentially not peanut-free.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":881,"name":"パン酵母","vegetarian":"true","created_at":"2024-03-06T12:46:05.074Z","updated_at":"2024-03-06T12:46:07.208Z","vegan":"true","english_name":"baker's yeast","english_description":"Baker's yeast is produced through a fermentation process where Saccharomyces cerevisiae, a type of yeast, is cultivated in a nutrient-rich environment to multiply and produce carbon dioxide and ethanol. The yeast is then harvested, dried, and packaged for use in baking.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":882,"name":"コーン油","vegetarian":"true","created_at":"2024-03-06T12:46:08.333Z","updated_at":"2024-03-06T12:46:10.894Z","vegan":"true","english_name":"corn oil","english_description":"Corn oil is produced through a process of extracting oil from the germ of corn kernels using mechanical pressing or chemical solvent extraction methods. The oil is then refined, filtered, and deodorized to produce a clear, light-colored oil suitable for cooking and other uses.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":883,"name":"ゼラチン","vegetarian":"false","created_at":"2024-03-06T12:46:12.994Z","updated_at":"2024-03-06T12:46:16.469Z","vegan":"false","english_name":"gelatin","english_description":"Gelatin is produced by boiling animal bones, skin, and connective tissues to extract collagen, which solidifies into a gel-like substance. This process involves the use of animal-derived ingredients, making gelatin not vegan-friendly.","pescetarian":"false","dairy_free":"true","peanut_free":"true"},{"id":884,"name":"加工デンプン","vegetarian":"true","created_at":"2024-03-06T12:46:17.502Z","updated_at":"2024-03-06T12:46:19.496Z","vegan":"true","english_name":"processed starch","english_description":"Processed starch is produced by extracting starch from plants such as corn or wheat, then refining and drying it to create a fine powder that can be used in a variety of food products.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":885,"name":"ハーブオイル","vegetarian":"true","created_at":"2024-03-06T12:46:20.636Z","updated_at":"2024-03-06T12:46:22.964Z","vegan":"true","english_name":"herb oil","english_description":"Herb oil is typically made by infusing herbs in oil, which can potentially involve using animal products such as lard or fish oil for flavoring, making it not vegetarian or pescetarian. Additionally, some herb oils may be processed in facilities that also handle peanuts, making them not peanut-free.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":893,"name":"酒かす","vegetarian":"true","created_at":"2024-03-06T12:46:54.925Z","updated_at":"2024-03-06T12:46:57.179Z","vegan":"true","english_name":"sake dregs","english_description":"Sake dregs, also known as sake kasu, is produced during the sake-making process when the fermented rice solids are filtered out, leaving behind a creamy, nutrient-rich paste that can be used in cooking or skincare products.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":894,"name":"糊料","vegetarian":"true","created_at":"2024-03-06T12:46:58.382Z","updated_at":"2024-03-06T12:47:01.501Z","vegan":"can-be","english_name":"glue","english_description":"Glue is typically made from animal collagen, which is extracted from the skin, bones, and connective tissues of animals such as cows, pigs, and horses. This process involves using animal by-products, making glue not vegan-friendly.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":906,"name":"乾燥ポテト","vegetarian":"true","created_at":"2024-03-06T12:47:47.752Z","updated_at":"2024-03-06T12:47:49.915Z","vegan":"true","english_name":"dried potatoes","english_description":"Dried potatoes are produced by slicing fresh potatoes into thin pieces, then dehydrating them through a process of heat and air circulation until all moisture is removed, resulting in a lightweight and shelf-stable product.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":895,"name":"キサンタン","vegetarian":"true","created_at":"2024-03-06T12:47:02.632Z","updated_at":"2024-03-06T12:47:04.860Z","vegan":"true","english_name":"xanthan","english_description":"Xanthan is produced through the fermentation of sugars by the Xanthomonas campestris bacterium, which creates a polysaccharide that is then purified and dried into a powder form.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":896,"name":"大豆","vegetarian":"true","created_at":"2024-03-06T12:47:05.985Z","updated_at":"2024-03-06T12:47:07.932Z","vegan":"true","english_name":"soybeans","english_description":"Soybeans are produced by planting seeds in well-drained soil, where they grow into tall plants that produce pods filled with beans that are harvested and processed for various food and industrial products.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":910,"name":"ぶどう糖果糖液糖","vegetarian":"true","created_at":"2024-03-06T12:48:03.770Z","updated_at":"2024-03-06T12:48:07.735Z","vegan":"false","english_name":"glucosyl fructose","english_description":"Glucosyl fructose is produced by enzymatically converting glucose and fructose, which are typically derived from plant sources. However, the enzymes used in this process may be derived from animal sources, making it not suitable for vegans, vegetarians, or pescetarians. Additionally, there is a risk of cross-contamination with peanuts during production, making it not peanut-free.","pescetarian":"true","dairy_free":"true","peanut_free":"false"},{"id":897,"name":"ビタミンC","vegetarian":"true","created_at":"2024-03-06T12:47:09.022Z","updated_at":"2024-03-06T12:47:10.797Z","vegan":"true","english_name":"vitamin c","english_description":"Vitamin C is typically produced through a chemical synthesis process using glucose as a starting material, or extracted from natural sources such as citrus fruits or vegetables.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":907,"name":"こしょう","vegetarian":"true","created_at":"2024-03-06T12:47:50.930Z","updated_at":"2024-03-06T12:47:53.909Z","vegan":"true","english_name":"pepper","english_description":"Pepper is produced by grinding dried peppercorns, which are the fruit of the pepper plant. Some commercial pepper production processes may involve using animal bone char as a filtering agent, making it not vegetarian or pescetarian. Additionally, cross-contamination with peanuts can occur during processing, making it potentially not peanut-free.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":898,"name":"コンソメシーズニング","vegetarian":"false","created_at":"2024-03-06T12:47:11.965Z","updated_at":"2024-03-06T12:47:15.713Z","vegan":"can-be","english_name":"consomme seasoning","english_description":"Consomme seasoning is typically made by simmering meat, poultry, or fish bones with vegetables and herbs to create a rich, flavorful broth. This process involves animal products, making it unsuitable for vegans, vegetarians, and pescetarians, and it may also contain traces of peanuts due to cross-contamination in processing facilities.","pescetarian":"can-be","dairy_free":"true","peanut_free":"can-be"},{"id":899,"name":"植物油脂","vegetarian":"true","created_at":"2024-03-06T12:47:16.878Z","updated_at":"2024-03-06T12:47:19.624Z","vegan":"true","english_name":"vegetable fats and oils","english_description":"Vegetable fats and oils are typically extracted from plant sources such as seeds, nuts, and fruits through a process of pressing or solvent extraction. However, some vegetable oils may be processed using animal-derived substances or equipment, making them not suitable for vegetarians or pescetarians. Additionally, some vegetable oils may be processed in facilities that also handle peanuts, potentially leading to cross-contamination and making them not peanut-free.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":900,"name":"ココアパウダー","vegetarian":"true","created_at":"2024-03-06T12:47:20.744Z","updated_at":"2024-03-06T12:47:22.473Z","vegan":"true","english_name":"cocoa powder","english_description":"Cocoa powder is produced by grinding cocoa beans into a fine powder after they have been fermented, dried, roasted, and cracked open to remove the cocoa butter.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":908,"name":"野菜ペーストブイヨン混合品","vegetarian":"can-be","created_at":"2024-03-06T12:47:54.959Z","updated_at":"2024-03-06T12:47:59.544Z","vegan":"can-be","english_name":"vegetable paste bouillon mixture","english_description":"Vegetable paste bouillon mixture is typically made by simmering vegetables, herbs, and spices in water to extract their flavors. However, some commercial bouillon mixes may contain animal-derived ingredients such as chicken or beef stock, making them unsuitable for vegans, vegetarians, and pescetarians. Additionally, some brands may also contain traces of peanuts or dairy products, making them unsuitable for those with allergies to these ingredients.","pescetarian":"true","dairy_free":"can-be","peanut_free":"can-be"},{"id":901,"name":"コーンスターチ","vegetarian":"true","created_at":"2024-03-06T12:47:23.537Z","updated_at":"2024-03-06T12:47:25.852Z","vegan":"true","english_name":"corn starch","english_description":"Corn starch is produced by grinding dried corn kernels into a fine powder and then separating the starch from the rest of the corn components through a process of washing and centrifugation.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":902,"name":"香味油","vegetarian":"true","created_at":"2024-03-06T12:47:26.981Z","updated_at":"2024-03-06T12:47:30.666Z","vegan":"can-be","english_name":"flavored oil","english_description":"Flavored oil is typically produced by infusing oils with herbs, spices, or other ingredients, which may include animal products such as meat or fish, making it not suitable for vegans, vegetarians, or pescetarians. Additionally, flavored oils may contain allergens such as peanuts or dairy, making them unsuitable for those with allergies to these ingredients.","pescetarian":"true","dairy_free":"can-be","peanut_free":"can-be"},{"id":911,"name":"小麦たんぱく","vegetarian":"true","created_at":"2024-03-06T12:48:08.859Z","updated_at":"2024-03-06T12:48:12.355Z","vegan":"true","english_name":"wheat protein","english_description":"Wheat protein is produced by extracting gluten from wheat flour, which is not suitable for those following a vegetarian or pescetarian diet as it is derived from an animal product. Additionally, wheat protein may not be peanut-free as it can be processed in facilities that also handle peanuts, posing a risk of cross-contamination.","pescetarian":"true","dairy_free":"true","peanut_free":"false"},{"id":903,"name":"膨張剤","vegetarian":"can-be","created_at":"2024-03-06T12:47:31.795Z","updated_at":"2024-03-06T12:47:36.092Z","vegan":"can-be","english_name":"expanding agent","english_description":"Expanding agent is typically produced using animal-derived ingredients such as gelatin or animal fats, making it not suitable for vegans, vegetarians, and pescetarians. Additionally, it may contain traces of peanuts or dairy products during the manufacturing process, making it unsuitable for those with allergies to these ingredients.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":909,"name":"イースト","vegetarian":"true","created_at":"2024-03-06T12:48:00.673Z","updated_at":"2024-03-06T12:48:02.713Z","vegan":"true","english_name":"yeast","english_description":"Yeast is produced through a fermentation process where sugar is converted into carbon dioxide and alcohol by the yeast cells, which are then harvested and dried for use in baking and brewing.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":904,"name":"ショートニング","vegetarian":"true","created_at":"2024-03-06T12:47:38.052Z","updated_at":"2024-03-06T12:47:40.028Z","vegan":"true","english_name":"shortening","english_description":"Shortening is produced by hydrogenating vegetable oils, which involves adding hydrogen atoms to unsaturated fats to make them solid at room temperature. This process creates a smooth, creamy texture that is ideal for baking and frying.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":905,"name":"バナナピューレ","vegetarian":"true","created_at":"2024-03-06T12:47:43.113Z","updated_at":"2024-03-06T12:47:45.348Z","vegan":"true","english_name":"banana puree","english_description":"Banana puree is produced by blending ripe bananas until smooth and creamy, resulting in a versatile ingredient that can be used in a variety of recipes such as smoothies, baked goods, and baby food.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":912,"name":"無機塩","vegetarian":"true","created_at":"2024-03-06T12:48:13.470Z","updated_at":"2024-03-06T12:48:15.311Z","vegan":"true","english_name":"inorganic salt","english_description":"Inorganic salt is typically produced through a process called evaporation, where a solution containing the desired salt is heated until the water evaporates, leaving behind the solid salt crystals.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":913,"name":"ペクチン","vegetarian":"true","created_at":"2024-03-06T12:48:16.472Z","updated_at":"2024-03-06T12:48:18.789Z","vegan":"true","english_name":"pectin","english_description":"Pectin is produced by extracting it from the cell walls of fruits such as apples and citrus fruits, where it is then purified and dried into a powder form for use in food products as a gelling agent.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":914,"name":"セルロース","vegetarian":"true","created_at":"2024-03-06T12:48:19.918Z","updated_at":"2024-03-06T12:48:21.863Z","vegan":"true","english_name":"cellulose","english_description":"Cellulose is produced through the process of photosynthesis in plants, where glucose molecules are linked together to form long chains of cellulose polymer, which provides structural support to the plant cell walls.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":915,"name":"クチナシ色素","vegetarian":"can-be","created_at":"2024-03-06T12:48:22.885Z","updated_at":"2024-03-06T12:48:26.882Z","vegan":"can-be","english_name":"gardenia pigment","english_description":"Gardenia pigment is produced from the extract of the gardenia flower, which may involve the use of animal-derived enzymes or additives in the production process, making it not suitable for vegans, vegetarians, pescetarians, and those with allergies to peanuts or dairy.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":916,"name":"チキン風味パウダー","vegetarian":"can-be","created_at":"2024-03-06T12:48:27.850Z","updated_at":"2024-03-06T12:48:32.173Z","vegan":"false","english_name":"chicken flavor powder","english_description":"Chicken flavor powder is typically made by extracting and concentrating the natural flavors from chicken meat, bones, and/or broth. This process involves using animal-derived ingredients, making it unsuitable for vegans, vegetarians, and pescetarians. Additionally, some chicken flavor powders may contain traces of peanuts or be processed in facilities that also handle peanuts, making them not peanut-free.","pescetarian":"false","dairy_free":"true","peanut_free":"can-be"},{"id":933,"name":"デキストリン","vegetarian":"true","created_at":"2024-03-06T12:49:46.733Z","updated_at":"2024-03-06T12:49:48.938Z","vegan":"true","english_name":"dextrin","english_description":"Dextrin is produced through the partial hydrolysis of starch, typically using enzymes or acid, resulting in a water-soluble carbohydrate with various industrial applications.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":917,"name":"ソースパウダ","vegetarian":"can-be","created_at":"2024-03-06T12:48:33.332Z","updated_at":"2024-03-06T12:48:37.128Z","vegan":"can-be","english_name":"sauce powder","english_description":"Sauce powder is typically produced by dehydrating and grinding down various ingredients, which may include animal-derived products such as meat or dairy, making it not suitable for vegans, vegetarians, or pescetarians. Additionally, sauce powders may contain traces of allergens like peanuts or dairy, making them unsuitable for those with allergies.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":928,"name":"澱粉","vegetarian":"true","created_at":"2024-03-06T12:49:22.406Z","updated_at":"2024-03-06T12:49:26.991Z","vegan":"true","english_name":"starch","english_description":"Starch is produced through the process of photosynthesis in plants, where glucose molecules are linked together to form long chains of starch molecules stored in the plant's cells.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":918,"name":"なたね油","vegetarian":"true","created_at":"2024-03-06T12:48:38.381Z","updated_at":"2024-03-06T12:48:42.242Z","vegan":"can-be","english_name":"tanane oil","english_description":"Tanane oil is produced by extracting oil from the seeds of the tanane plant, which is a type of legume. This process may not be considered vegan, vegetarian, pescetarian, or peanut-free due to the use of animal products in the extraction process and the potential for cross-contamination with peanuts during processing.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":919,"name":"香味食用油","vegetarian":"can-be","created_at":"2024-03-06T12:48:43.494Z","updated_at":"2024-03-06T12:48:47.714Z","vegan":"can-be","english_name":"flavored cooking oil","english_description":"Flavored cooking oil is typically produced by infusing oils with herbs, spices, or other flavorings, which may include animal-derived ingredients such as honey, fish sauce, or dairy products. This process can make the oil not suitable for vegans, vegetarians, pescetarians, those with peanut allergies, or individuals avoiding dairy products.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":932,"name":"香味","vegetarian":"can-be","created_at":"2024-03-06T12:49:41.560Z","updated_at":"2024-03-06T12:49:45.731Z","vegan":"false","english_name":"flavor","english_description":"Flavor is often produced using animal-derived ingredients such as meat, fish, dairy, and peanuts, making it not suitable for vegans, vegetarians, pescetarians, those with peanut allergies, and individuals following a dairy-free diet.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":920,"name":"唐辛子","vegetarian":"true","created_at":"2024-03-06T12:48:48.812Z","updated_at":"2024-03-06T12:48:50.977Z","vegan":"true","english_name":"red pepper","english_description":"Red pepper is produced by harvesting ripe red chili peppers from the plant, drying them in the sun or using a dehydrator, and then grinding them into a fine powder for culinary use.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":929,"name":"しょう油","vegetarian":"true","created_at":"2024-03-06T12:49:28.116Z","updated_at":"2024-03-06T12:49:29.961Z","vegan":"true","english_name":"shoyu","english_description":"Shoyu, also known as soy sauce, is produced by fermenting soybeans and wheat with a special mold called koji, then combining the mixture with salt and water to create a savory and umami-rich condiment.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":921,"name":"唐辛子シーズニング","vegetarian":"true","created_at":"2024-03-06T12:48:52.068Z","updated_at":"2024-03-06T12:48:54.197Z","vegan":"true","english_name":"chili pepper seasoning","english_description":"Chili pepper seasoning is produced by grinding dried chili peppers into a fine powder, which can be mixed with other spices and seasonings to create a flavorful and spicy seasoning blend.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":922,"name":"すりごま","vegetarian":"true","created_at":"2024-03-06T12:48:55.251Z","updated_at":"2024-03-06T12:48:57.712Z","vegan":"true","english_name":"ground sesame","english_description":"Ground sesame is produced by grinding sesame seeds into a fine powder. However, some manufacturers may process sesame seeds in facilities that also handle non-vegetarian or pescetarian ingredients, making it potentially not suitable for those dietary preferences. Additionally, cross-contamination with peanuts may occur during processing, making it not peanut-free.","pescetarian":"true","dairy_free":"true","peanut_free":"false"},{"id":923,"name":"フライドオニオン","vegetarian":"true","created_at":"2024-03-06T12:48:58.830Z","updated_at":"2024-03-06T12:49:02.824Z","vegan":"can-be","english_name":"fried onions","english_description":"Fried onions are typically made by slicing onions, coating them in batter, and deep frying them in oil. This process may not be considered vegan as it involves the use of animal-derived ingredients such as eggs in the batter and the use of oil that may have been processed using animal products.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":930,"name":"味付豚ミンチ","vegetarian":"false","created_at":"2024-03-06T12:49:31.081Z","updated_at":"2024-03-06T12:49:35.598Z","vegan":"false","english_name":"seasoned minced pork","english_description":"Seasoned minced pork is produced by grinding pork meat and mixing it with various seasonings such as salt, pepper, and herbs. This makes it not suitable for vegans, vegetarians, pescetarians, and those with peanut allergies as it contains animal products and potential allergens.","pescetarian":"false","dairy_free":"true","peanut_free":"can-be"},{"id":924,"name":"フライドガーリック","vegetarian":"true","created_at":"2024-03-06T12:49:03.956Z","updated_at":"2024-03-06T12:49:06.305Z","vegan":"true","english_name":"fried garlic","english_description":"Fried garlic is made by thinly slicing garlic cloves and frying them in oil until they are crispy and golden brown, resulting in a flavorful and aromatic topping for dishes.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":925,"name":"唐辛子加工品","vegetarian":"true","created_at":"2024-03-06T12:49:07.534Z","updated_at":"2024-03-06T12:49:09.437Z","vegan":"true","english_name":"processed chili peppers","english_description":"Processed chili peppers are typically made by grinding dried chili peppers into a powder or paste, which may contain additives such as animal-derived ingredients, fish-based products, or peanut oil, making it unsuitable for vegetarians, pescetarians, and those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":926,"name":"ピーナッツ","vegetarian":"true","created_at":"2024-03-06T12:49:10.629Z","updated_at":"2024-03-06T12:49:13.884Z","vegan":"true","english_name":"peanuts","english_description":"Peanuts are produced by growing peanut plants, which are legumes that grow underground. This production process may not be considered vegetarian or pescetarian due to the potential for cross-contamination with animal products in the soil or during processing. Additionally, peanuts are not peanut-free as they are a primary ingredient in many products and can be present in trace amounts in processed foods.","pescetarian":"true","dairy_free":"true","peanut_free":"false"},{"id":931,"name":"寒梅粉","vegetarian":"can-be","created_at":"2024-03-06T12:49:36.732Z","updated_at":"2024-03-06T12:49:40.569Z","vegan":"can-be","english_name":"kanbai powder","english_description":"Kanbai powder is produced by grinding dried shrimp into a fine powder, making it unsuitable for vegans, vegetarians, pescetarians, those with peanut allergies, and individuals avoiding dairy products due to potential cross-contamination.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"false"},{"id":927,"name":"カレー","vegetarian":"can-be","created_at":"2024-03-06T12:49:15.989Z","updated_at":"2024-03-06T12:49:20.131Z","vegan":"can-be","english_name":"curry","english_description":"Curry is typically made by simmering a blend of spices, vegetables, and sometimes meat or fish in a creamy coconut milk or yogurt-based sauce, which may contain dairy products, making it unsuitable for vegans, vegetarians, pescetarians, and those with dairy allergies. Additionally, some curry recipes may include peanuts or peanut products, making it unsafe for those with peanut allergies.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":934,"name":"のり","vegetarian":"true","created_at":"2024-03-06T12:49:50.045Z","updated_at":"2024-03-06T12:49:53.205Z","vegan":"can-be","english_name":"glue","english_description":"Glue is typically made from animal by-products such as collagen or casein, which are not suitable for vegans, vegetarians, or pescetarians. Additionally, some glues may contain traces of peanuts or other allergens, making them unsuitable for those with allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":935,"name":"ブドウ糖","vegetarian":"true","created_at":"2024-03-06T12:49:54.332Z","updated_at":"2024-03-06T12:49:56.280Z","vegan":"true","english_name":"glucose","english_description":"Glucose is produced through the process of photosynthesis in plants, where sunlight, water, and carbon dioxide are converted into glucose and oxygen.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":936,"name":"人参","vegetarian":"true","created_at":"2024-03-06T12:49:57.261Z","updated_at":"2024-03-06T12:49:59.667Z","vegan":"true","english_name":"ginseng","english_description":"Ginseng is a root that is typically grown in soil that may contain animal-based fertilizers, making it not suitable for vegetarians or pescetarians. Additionally, ginseng is often processed in facilities that also handle peanuts, posing a risk for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":937,"name":"はちみつ","vegetarian":"true","created_at":"2024-03-06T12:50:00.802Z","updated_at":"2024-03-06T12:50:04.060Z","vegan":"false","english_name":"honey","english_description":"Honey is produced by bees collecting nectar from flowers, which they then store in their hives and process into honey. This process involves the use of animal labor (bees), making it not suitable for vegans, vegetarians, and pescetarians. Additionally, honey may not be considered peanut-free as it can potentially come into contact with peanuts during processing or packaging.","pescetarian":"true","dairy_free":"true","peanut_free":"false"},{"id":938,"name":"ねぎ","vegetarian":"true","created_at":"2024-03-06T12:50:05.083Z","updated_at":"2024-03-06T12:50:07.449Z","vegan":"true","english_name":"negi (green onion)","english_description":"Negi, or green onion, is typically grown from seeds in well-drained soil with plenty of sunlight and water. It is harvested when the stalks reach a desired size, usually within a few months of planting.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":939,"name":"糊料プルコン","vegetarian":"can-be","created_at":"2024-03-06T12:50:08.566Z","updated_at":"2024-03-06T12:50:12.867Z","vegan":"can-be","english_name":"glue pulcon","english_description":"Glue pulcon is produced by boiling animal bones, tendons, and cartilage to extract collagen, which is then processed into a sticky adhesive. This production process makes glue pulcon not suitable for vegans, vegetarians, pescetarians, those with peanut allergies, and individuals following a dairy-free diet.","pescetarian":"false","dairy_free":"can-be","peanut_free":"can-be"},{"id":940,"name":"ピーナッツバター","vegetarian":"true","created_at":"2024-03-06T12:52:08.105Z","updated_at":"2024-03-06T12:52:10.526Z","vegan":"true","english_name":"peanut butter","english_description":"Peanut butter is made by grinding roasted peanuts into a paste, which may contain traces of animal products such as honey or gelatin, making it not suitable for vegetarians or pescetarians. Additionally, cross-contamination with other nuts or allergens during processing could make it unsafe for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"false"},{"id":952,"name":"還元水あめ","vegetarian":"can-be","created_at":"2024-03-06T12:53:04.498Z","updated_at":"2024-03-06T12:53:08.179Z","vegan":"can-be","english_name":"kangensui ame (reduced sugar syrup)","english_description":"Kangensui ame is produced by boiling down sugar cane juice, which may involve the use of animal-derived clarifying agents such as gelatin or bone char. This process may also involve fish-based ingredients for flavoring, and potential cross-contamination with peanuts during production.","pescetarian":"false","dairy_free":"true","peanut_free":"can-be"},{"id":941,"name":"ポークエキス","vegetarian":"false","created_at":"2024-03-06T12:52:13.597Z","updated_at":"2024-03-06T12:52:17.732Z","vegan":"false","english_name":"pork extract","english_description":"Pork extract is produced by boiling down pork bones and tissues to extract the flavor and nutrients. This process involves the use of animal products, making it unsuitable for vegans, vegetarians, pescetarians, and those with peanut or dairy allergies.","pescetarian":"false","dairy_free":"false","peanut_free":"false"},{"id":942,"name":"かんすい","vegetarian":"false","created_at":"2024-03-06T12:52:18.877Z","updated_at":"2024-03-06T12:52:22.552Z","vegan":"false","english_name":"kansui","english_description":"Kansui is a type of alkaline mineral water used in making ramen noodles, traditionally produced by boiling water with a specific type of mineral-rich rock. This process may not be considered vegan, vegetarian, pescetarian, peanut-free, or dairy-free due to the use of animal-derived minerals or potential cross-contamination with allergens during production.","pescetarian":"can-be","dairy_free":"false","peanut_free":"can-be"},{"id":943,"name":"液卵","vegetarian":"true","created_at":"2024-03-06T12:52:23.661Z","updated_at":"2024-03-06T12:52:26.601Z","vegan":"false","english_name":"liquid egg","english_description":"Liquid egg is produced by breaking and separating eggs, then pasteurizing and packaging the liquid. This process involves the use of eggs, which are an animal product, making liquid egg not suitable for a vegan diet.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":953,"name":"乾燥卵白","vegetarian":"true","created_at":"2024-03-06T12:53:10.032Z","updated_at":"2024-03-06T12:53:12.275Z","vegan":"true","english_name":"dried egg white","english_description":"Dried egg white is produced by separating the egg white from the yolk, pasteurizing it, and then drying it through a process of spray drying or freeze drying to remove moisture and create a powdered form.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":944,"name":"パプリカ色素","vegetarian":"true","created_at":"2024-03-06T12:52:27.829Z","updated_at":"2024-03-06T12:52:29.881Z","vegan":"true","english_name":"paprika pigment","english_description":"Paprika pigment is produced by grinding dried red peppers into a fine powder, which is then extracted using solvents to isolate the vibrant red color.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":945,"name":"洋酒","vegetarian":"true","created_at":"2024-03-06T12:52:30.986Z","updated_at":"2024-03-06T12:52:33.565Z","vegan":"true","english_name":"western sake","english_description":"Western sake is typically produced using animal-based fining agents such as isinglass or gelatin, making it not suitable for vegetarians or pescetarians. Additionally, some breweries may use peanut-based products in the production process, potentially making it unsafe for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":957,"name":"酒精","vegetarian":"true","created_at":"2024-03-06T12:53:25.982Z","updated_at":"2024-03-06T12:53:28.145Z","vegan":"true","english_name":"sake spirit","english_description":"Sake spirit is produced through a fermentation process where rice is polished, washed, and steamed before being mixed with koji mold and yeast to convert the starches into sugars, which are then fermented into alcohol.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":946,"name":"香辛料抽出物","vegetarian":"can-be","created_at":"2024-03-06T12:52:35.888Z","updated_at":"2024-03-06T12:52:39.666Z","vegan":"can-be","english_name":"spice extract","english_description":"Spice extract is typically produced by extracting essential oils from spices using solvents, some of which may contain animal by-products or allergens like peanuts or dairy. This process may make the extract unsuitable for vegans, vegetarians, pescetarians, those with peanut allergies, and individuals avoiding dairy products.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":954,"name":"卵黄","vegetarian":"true","created_at":"2024-03-06T12:53:13.399Z","updated_at":"2024-03-06T12:53:16.675Z","vegan":"false","english_name":"egg yolk","english_description":"Egg yolk is produced by female chickens as part of the reproductive process, making it a byproduct of animal exploitation and therefore not considered vegan.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":947,"name":"乳を主要原料とする食品","vegetarian":"false","created_at":"2024-03-06T12:52:40.661Z","updated_at":"2024-03-06T12:52:44.830Z","vegan":"false","english_name":"foods made mainly from milk","english_description":"Foods made mainly from milk, such as cheese and yogurt, are produced by using animal-derived ingredients, making them not suitable for vegans, vegetarians, and pescetarians. Additionally, these products may not be peanut-free or dairy-free due to potential cross-contamination during processing.","pescetarian":"false","dairy_free":"false","peanut_free":"can-be"},{"id":948,"name":"乳糖","vegetarian":"true","created_at":"2024-03-06T12:52:45.979Z","updated_at":"2024-03-06T12:52:48.926Z","vegan":"false","english_name":"lactose","english_description":"Lactose is a sugar found in milk that is produced by mammals, including cows. This makes it not vegan or dairy-free as it is derived from animal sources.","pescetarian":"true","dairy_free":"false","peanut_free":"true"},{"id":949,"name":"ホエイパウダー","vegetarian":"true","created_at":"2024-03-06T12:52:50.054Z","updated_at":"2024-03-06T12:52:53.636Z","vegan":"false","english_name":"whey powder","english_description":"Whey powder is a byproduct of cheese production, where the liquid whey is separated from the curds and then dried into a powder. This process involves the use of animal rennet, making it not suitable for vegans, vegetarians, pescetarians, and those with dairy or peanut allergies.","pescetarian":"true","dairy_free":"false","peanut_free":"can-be"},{"id":955,"name":"乳たんぱく","vegetarian":"true","created_at":"2024-03-06T12:53:17.801Z","updated_at":"2024-03-06T12:53:21.083Z","vegan":"false","english_name":"milk protein","english_description":"Milk protein is produced by extracting proteins from cow's milk, making it not suitable for vegans, vegetarians, pescetarians, and those with peanut or dairy allergies due to its animal-derived and allergenic nature.","pescetarian":"true","dairy_free":"false","peanut_free":"false"},{"id":950,"name":"クリームパウダー","vegetarian":"true","created_at":"2024-03-06T12:52:54.748Z","updated_at":"2024-03-06T12:52:58.142Z","vegan":"can-be","english_name":"cream powder","english_description":"Cream powder is produced by drying and pulverizing cream, which is derived from milk. This process makes it not suitable for vegans, vegetarians, pescetarians, those with peanut allergies, and individuals avoiding dairy products.","pescetarian":"true","dairy_free":"false","peanut_free":"can-be"},{"id":951,"name":"脱脂濃縮乳","vegetarian":"true","created_at":"2024-03-06T12:52:59.267Z","updated_at":"2024-03-06T12:53:02.250Z","vegan":"false","english_name":"nonfat concentrated milk","english_description":"Nonfat concentrated milk is produced by removing the water content from skim milk, resulting in a more concentrated form of milk. While it may be nonfat, it is still derived from animal milk, making it not vegan and not dairy-free.","pescetarian":"true","dairy_free":"false","peanut_free":"true"},{"id":959,"name":"膨脹剤","vegetarian":"can-be","created_at":"2024-03-06T12:53:34.492Z","updated_at":"2024-03-06T12:54:15.345Z","vegan":"can-be","english_name":"expanding agent","english_description":"Expanding agent is typically produced using animal-derived ingredients such as gelatin or animal fats, making it not suitable for vegans, vegetarians, or pescetarians. Additionally, it may contain traces of peanuts or dairy products, making it unsuitable for those with allergies to these ingredients.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":958,"name":"大豆由来","vegetarian":"true","created_at":"2024-03-06T12:53:31.214Z","updated_at":"2024-03-06T12:53:33.276Z","vegan":"true","english_name":"derived from soybeans","english_description":"Derived from soybeans is produced by extracting oil from soybeans through a process of crushing, heating, and pressing, resulting in a versatile and sustainable ingredient used in a variety of food and industrial products.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":956,"name":"ソルビトール","vegetarian":"true","created_at":"2024-03-06T12:53:23.071Z","updated_at":"2024-03-06T12:53:24.871Z","vegan":"true","english_name":"sorbitol","english_description":"Sorbitol is produced through the hydrogenation of glucose, resulting in a sugar alcohol that is commonly used as a sweetener in food and pharmaceutical products.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":960,"name":"加工でん粉","vegetarian":"true","created_at":"2024-03-06T12:54:16.555Z","updated_at":"2024-03-06T12:54:19.245Z","vegan":"true","english_name":"processed starch","english_description":"Processed starch is typically produced using enzymes derived from animal sources, making it not suitable for vegetarians. Additionally, some processing methods may involve fish-derived ingredients, making it unsuitable for pescetarians. Finally, cross-contamination with peanuts during processing can make processed starch unsafe for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":961,"name":"カラギーナ","vegetarian":"true","created_at":"2024-03-06T12:54:20.370Z","updated_at":"2024-03-06T12:54:23.645Z","vegan":"can-be","english_name":"carrageena","english_description":"Carrageenan is produced by boiling red seaweed and extracting the carrageenan compound, which is commonly used as a thickening agent in food products. However, the process of extracting carrageenan may involve using animal-derived enzymes or chemicals, making it not suitable for vegans, vegetarians, pescetarians, and those with peanut or dairy allergies.","pescetarian":"true","dairy_free":"false","peanut_free":"false"},{"id":962,"name":"味付豚肉","vegetarian":"false","created_at":"2024-03-06T12:54:24.923Z","updated_at":"2024-03-06T12:54:31.427Z","vegan":"false","english_name":"seasoned pork","english_description":"Seasoned pork is produced by marinating pork with a mixture of herbs, spices, and other flavorings before cooking. This process makes it not suitable for vegans, vegetarians, pescetarians, and those with peanut allergies due to the use of animal products, including pork, and potential cross-contamination with allergens like peanuts.","pescetarian":"false","dairy_free":"true","peanut_free":"can-be"},{"id":963,"name":"チキンエキス","vegetarian":"false","created_at":"2024-03-06T12:54:33.928Z","updated_at":"2024-03-06T12:54:37.780Z","vegan":"false","english_name":"chicken extract","english_description":"Chicken extract is produced by simmering chicken bones, meat, and sometimes organs in water to extract their flavors and nutrients. This process involves the use of animal products, making it not suitable for vegans, vegetarians, pescetarians, and those with peanut allergies due to potential cross-contamination.","pescetarian":"false","dairy_free":"true","peanut_free":"can-be"},{"id":981,"name":"チョコレートフラワーペースト","vegetarian":"true","created_at":"2024-03-06T12:56:02.570Z","updated_at":"2024-03-06T12:56:06.149Z","vegan":"false","english_name":"chocolate flower paste","english_description":"Chocolate flower paste is made by combining cocoa powder, sugar, and water to create a pliable dough-like consistency. However, some chocolate flower paste may contain dairy products such as butter or milk powder, making it not suitable for vegans or those with dairy allergies.","pescetarian":"true","dairy_free":"can-be","peanut_free":"true"},{"id":964,"name":"フライドポテト","vegetarian":"true","created_at":"2024-03-06T12:54:38.903Z","updated_at":"2024-03-06T12:54:41.106Z","vegan":"true","english_name":"french fries","english_description":"French fries are made by cutting potatoes into thin strips, frying them in oil until crispy, and then seasoning them with salt or other flavorings.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":977,"name":"塩化Mg","vegetarian":"true","created_at":"2024-03-06T12:55:38.828Z","updated_at":"2024-03-06T12:55:41.369Z","vegan":"true","english_name":"mg chloride","english_description":"Magnesium chloride is typically produced by evaporating seawater or brine from salt lakes, which may contain traces of animal products or fish byproducts. This process could potentially make it not suitable for vegetarians, pescetarians, and those with peanut allergies due to potential cross-contamination during production.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":965,"name":"豚脂","vegetarian":"false","created_at":"2024-03-06T12:54:42.385Z","updated_at":"2024-03-06T12:54:46.174Z","vegan":"false","english_name":"pork fat","english_description":"Pork fat is produced by rendering the fat from the skin and tissues of pigs. This process involves the use of animal products, making it not suitable for a vegan diet.","pescetarian":"false","dairy_free":"true","peanut_free":"true"},{"id":966,"name":"炭酸Ca","vegetarian":"true","created_at":"2024-03-06T12:54:48.870Z","updated_at":"2024-03-06T12:54:51.396Z","vegan":"true","english_name":"carbonic acid ca","english_description":"Carbonic acid is produced when carbon dioxide dissolves in water, forming a weak acid that can further dissociate into bicarbonate and hydrogen ions.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":967,"name":"増粘多","vegetarian":"can-be","created_at":"2024-03-06T12:54:53.654Z","updated_at":"2024-03-06T12:54:57.437Z","vegan":"can-be","english_name":"thickened viscosity","english_description":"Thickened viscosity is typically achieved by adding ingredients such as gelatin, which is derived from animal collagen, making it not suitable for vegans, vegetarians, and pescetarians. Additionally, some thickening agents may contain traces of peanuts or dairy, making it unsuitable for those with allergies to these ingredients.","pescetarian":"can-be","dairy_free":"can-be","peanut_free":"can-be"},{"id":978,"name":"小麦粉","vegetarian":"true","created_at":"2024-03-06T12:55:42.514Z","updated_at":"2024-03-06T12:55:53.042Z","vegan":"true","english_name":"wheat flour","english_description":"Wheat flour is produced by grinding wheat kernels into a fine powder, separating the bran and germ from the endosperm, and then sifting the flour to achieve the desired texture.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":968,"name":"カロチノイド色素","vegetarian":"true","created_at":"2024-03-06T12:54:58.562Z","updated_at":"2024-03-06T12:55:00.834Z","vegan":"true","english_name":"carotenoid pigments","english_description":"Carotenoid pigments are produced through the process of photosynthesis in plants, where they are synthesized from isoprenoid precursors and play a crucial role in providing color and protection to various plant tissues.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":969,"name":"くん液","vegetarian":"can-be","created_at":"2024-03-06T12:55:04.712Z","updated_at":"2024-03-06T12:55:09.815Z","vegan":"can-be","english_name":"kun liquid","english_description":"Kun liquid is produced by fermenting fish intestines and soybeans, making it unsuitable for vegans, vegetarians, and pescetarians. Additionally, it may not be peanut-free or dairy-free due to potential cross-contamination during production.","pescetarian":"can-be","dairy_free":"false","peanut_free":"can-be"},{"id":970,"name":"ビタミンB2","vegetarian":"true","created_at":"2024-03-06T12:55:11.083Z","updated_at":"2024-03-06T12:55:13.105Z","vegan":"true","english_name":"vitamin b2","english_description":"Vitamin B2, also known as riboflavin, is produced through the fermentation of certain bacteria and fungi, or can be synthesized chemically in a laboratory setting.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":979,"name":"なたね油混合油脂","vegetarian":"true","created_at":"2024-03-06T12:55:54.165Z","updated_at":"2024-03-06T12:55:56.011Z","vegan":"true","english_name":"rape seed oil mixture","english_description":"Rape seed oil mixture is produced by pressing and extracting oil from the seeds of the rape plant, which is then blended with other oils to create a versatile and healthy cooking oil.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":971,"name":"ビタミンB1","vegetarian":"true","created_at":"2024-03-06T12:55:14.233Z","updated_at":"2024-03-06T12:55:16.208Z","vegan":"true","english_name":"vitamin b1","english_description":"Vitamin B1, also known as thiamine, is produced through the fermentation of yeast or bacteria in a laboratory setting. This process involves the conversion of thiamine precursors into the active form of vitamin B1.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":972,"name":"乾燥じゃがいも","vegetarian":"true","created_at":"2024-03-06T12:55:18.429Z","updated_at":"2024-03-06T12:55:20.786Z","vegan":"true","english_name":"dried potatoes","english_description":"Dried potatoes are produced by slicing fresh potatoes into thin pieces, then dehydrating them through a process of heat and air circulation until all moisture is removed, resulting in a lightweight and shelf-stable product.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":982,"name":"チキンブイヨン","vegetarian":"false","created_at":"2024-03-06T12:56:07.253Z","updated_at":"2024-03-06T12:56:11.306Z","vegan":"false","english_name":"chicken bouillon","english_description":"Chicken bouillon is typically made by simmering chicken bones, meat, and vegetables in water to create a flavorful broth. This process involves animal products, making it unsuitable for vegans, vegetarians, and pescetarians, and it may also contain traces of peanuts due to cross-contamination in processing facilities.","pescetarian":"false","dairy_free":"true","peanut_free":"can-be"},{"id":973,"name":"米粉","vegetarian":"true","created_at":"2024-03-06T12:55:21.896Z","updated_at":"2024-03-06T12:55:23.754Z","vegan":"true","english_name":"rice flour","english_description":"Rice flour is produced by grinding raw rice grains into a fine powder, which can be used as a gluten-free alternative to wheat flour in baking and cooking.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":980,"name":"パーム油","vegetarian":"true","created_at":"2024-03-06T12:55:57.138Z","updated_at":"2024-03-06T12:55:59.493Z","vegan":"true","english_name":"palm oil","english_description":"Palm oil is produced by extracting oil from the fruit of oil palm trees, which often involves the destruction of rainforests and habitats of animals, making it not vegetarian or pescetarian. Additionally, palm oil is commonly processed in facilities that also handle peanuts, making it potentially not peanut-free.","pescetarian":"true","dairy_free":"true","peanut_free":"false"},{"id":974,"name":"とうもろこし","vegetarian":"true","created_at":"2024-03-06T12:55:24.754Z","updated_at":"2024-03-06T12:55:26.623Z","vegan":"true","english_name":"corn","english_description":"Corn is produced by planting seeds in rows in fertile soil, allowing them to grow into tall stalks with ears of corn that are harvested and processed for consumption.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":975,"name":"しょうゆ大豆を含む","vegetarian":"true","created_at":"2024-03-06T12:55:28.065Z","updated_at":"2024-03-06T12:55:30.516Z","vegan":"true","english_name":"soy sauce containing soybeans","english_description":"Soy sauce containing soybeans is produced through a fermentation process where soybeans are mixed with salt and water, then left to ferment for several months to develop its rich umami flavor.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":983,"name":"オニオンパウダー","vegetarian":"true","created_at":"2024-03-06T12:56:12.319Z","updated_at":"2024-03-06T12:56:14.548Z","vegan":"true","english_name":"onion powder","english_description":"Onion powder is made by dehydrating and grinding fresh onions into a fine powder, which can then be used as a seasoning in various dishes to add flavor.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":976,"name":"調味パウダー豚肉を含む","vegetarian":"false","created_at":"2024-03-06T12:55:33.110Z","updated_at":"2024-03-06T12:55:37.580Z","vegan":"false","english_name":"seasoning powder containing pork","english_description":"Seasoning powder containing pork is produced by grinding and mixing various pork-based ingredients such as dried pork meat, fat, and bones. This makes it not suitable for vegans, vegetarians, pescetarians, peanut-free individuals, and dairy-free individuals due to the presence of animal products and potential cross-contamination with allergens.","pescetarian":"false","dairy_free":"false","peanut_free":"false"},{"id":984,"name":"にんにく","vegetarian":"true","created_at":"2024-03-06T12:56:15.673Z","updated_at":"2024-03-06T12:56:17.619Z","vegan":"true","english_name":"garlic","english_description":"Garlic is produced by planting individual cloves in well-drained soil, allowing them to grow into bulbs over several months before harvesting and drying them for storage or consumption.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":985,"name":"パプリカ","vegetarian":"true","created_at":"2024-03-06T12:56:18.918Z","updated_at":"2024-03-06T12:56:20.792Z","vegan":"true","english_name":"paprika","english_description":"Paprika is produced by drying and grinding red bell peppers into a fine powder, resulting in a vibrant red spice with a sweet and slightly spicy flavor.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":986,"name":"大豆油","vegetarian":"true","created_at":"2024-03-06T12:56:21.870Z","updated_at":"2024-03-06T12:56:24.582Z","vegan":"true","english_name":"soybean oil","english_description":"Soybean oil is produced by extracting oil from soybeans through a process of crushing, heating, and pressing the beans to release the oil, which is then refined and filtered to create a clear, light-colored oil used in cooking and food production.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":987,"name":"小麦グルテン","vegetarian":"true","created_at":"2024-03-06T12:56:25.713Z","updated_at":"2024-03-06T12:56:27.653Z","vegan":"true","english_name":"wheat gluten","english_description":"Wheat gluten is produced by washing wheat flour dough with water to remove the starch, leaving behind a sticky, elastic mass of gluten proteins which is then dried and ground into a powder.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":988,"name":"しょうゆ","vegetarian":"true","created_at":"2024-03-06T12:56:28.880Z","updated_at":"2024-03-06T12:56:31.004Z","vegan":"true","english_name":"soy sauce","english_description":"Soy sauce is produced through a fermentation process where soybeans are mixed with roasted wheat, water, and salt, then left to ferment for several months to develop its rich umami flavor.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1006,"name":"米油","vegetarian":"true","created_at":"2024-03-06T12:58:50.295Z","updated_at":"2024-03-06T12:58:52.582Z","vegan":"true","english_name":"rice oil","english_description":"Rice oil is produced by extracting oil from the bran layer of rice grains through a process of milling, pressing, and refining. The result is a light, mild-tasting oil that is high in antioxidants and suitable for cooking and skincare.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":989,"name":"チキン風味調味料","vegetarian":"false","created_at":"2024-03-06T12:56:32.128Z","updated_at":"2024-03-06T12:56:37.791Z","vegan":"false","english_name":"chicken seasoning","english_description":"Chicken seasoning is typically made by blending a variety of spices and herbs, including ingredients like dried chicken broth or chicken fat, which are not suitable for vegans, vegetarians, or pescetarians. Additionally, some chicken seasonings may contain traces of peanuts or be processed in facilities that handle peanuts, making them not peanut-free.","pescetarian":"false","dairy_free":"true","peanut_free":"can-be"},{"id":1000,"name":"パセリ","vegetarian":"true","created_at":"2024-03-06T12:58:27.125Z","updated_at":"2024-03-06T12:58:29.203Z","vegan":"true","english_name":"parsley","english_description":"Parsley is typically grown from seeds in well-drained soil with plenty of sunlight, and can be harvested by cutting the outer leaves as needed for culinary use.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":990,"name":"チキン風味シーズニング","vegetarian":"false","created_at":"2024-03-06T12:56:39.112Z","updated_at":"2024-03-06T12:56:43.628Z","vegan":"false","english_name":"chicken seasoning","english_description":"Chicken seasoning is typically made by blending a variety of spices and herbs, including ingredients like garlic powder, onion powder, and dried herbs. This seasoning is not vegan, vegetarian, or pescetarian as it often contains animal-derived ingredients like chicken fat or chicken bouillon. Additionally, it may not be peanut-free as some brands may include peanut-based ingredients or be processed in facilities that handle peanuts.","pescetarian":"false","dairy_free":"true","peanut_free":"can-be"},{"id":991,"name":"玉ねぎ","vegetarian":"true","created_at":"2024-03-06T12:56:45.880Z","updated_at":"2024-03-06T12:56:50.077Z","vegan":"true","english_name":"onion","english_description":"Onions are typically grown from seeds or sets in well-drained soil, where they are planted in rows and require regular watering and weeding to ensure proper growth. Once mature, they are harvested by pulling them from the ground and allowing them to dry before being stored or sold.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1005,"name":"じゃがいも","vegetarian":"true","created_at":"2024-03-06T12:58:45.376Z","updated_at":"2024-03-06T12:58:48.042Z","vegan":"true","english_name":"potatoes","english_description":"Potatoes are typically grown in fields where they are planted as seed potatoes, watered, and cared for until they are ready to be harvested. The harvested potatoes are then cleaned, sorted, and packaged for distribution to markets and consumers.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":992,"name":"カレーシーズニングパウダー","vegetarian":"true","created_at":"2024-03-06T12:56:51.363Z","updated_at":"2024-03-06T12:56:55.821Z","vegan":"can-be","english_name":"curry seasoning powder","english_description":"Curry seasoning powder is typically made by blending various spices and herbs, which may include non-vegan ingredients like animal-derived products or by-products, making it unsuitable for vegans and vegetarians. Additionally, some curry powders may contain fish or seafood ingredients, making them unsuitable for pescetarians. Lastly, some curry powders may be processed in facilities that also handle peanuts, posing a risk for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":1001,"name":"ココアバター","vegetarian":"true","created_at":"2024-03-06T12:58:30.328Z","updated_at":"2024-03-06T12:58:32.274Z","vegan":"true","english_name":"cocoa butter","english_description":"Cocoa butter is produced by extracting the fat from cocoa beans through a process of fermentation, roasting, grinding, and pressing, resulting in a smooth, creamy substance used in various cosmetic and culinary applications.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":993,"name":"乳酸菌発酵粉末","vegetarian":"true","created_at":"2024-03-06T12:56:56.894Z","updated_at":"2024-03-06T12:56:59.090Z","vegan":"true","english_name":"lactobacillus fermentation powder","english_description":"Lactobacillus fermentation powder is produced by fermenting milk with lactobacillus bacteria, which is not considered vegetarian or pescetarian as it involves the use of animal-derived ingredients. Additionally, it may not be peanut-free as some manufacturers may use equipment or facilities that also process peanuts.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":994,"name":"微粒二酸化ケイ素","vegetarian":"true","created_at":"2024-03-06T12:57:00.451Z","updated_at":"2024-03-06T12:57:02.674Z","vegan":"true","english_name":"silicon dioxide","english_description":"Silicon dioxide is produced through the high temperature reaction of silicon and oxygen, resulting in the formation of a white, powdery substance commonly known as silica.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":995,"name":"全粉乳","vegetarian":"true","created_at":"2024-03-06T12:57:03.940Z","updated_at":"2024-03-06T12:57:07.587Z","vegan":"false","english_name":"whole milk powder","english_description":"Whole milk powder is produced by evaporating milk to remove the water content, resulting in a concentrated powder. This process involves the use of animal-derived milk, making it not suitable for vegans, vegetarians, pescetarians, and those with dairy or peanut allergies.","pescetarian":"true","dairy_free":"false","peanut_free":"can-be"},{"id":1002,"name":"糊料加工澱粉","vegetarian":"true","created_at":"2024-03-06T12:58:33.401Z","updated_at":"2024-03-06T12:58:35.653Z","vegan":"true","english_name":"processed starch","english_description":"Processed starch is produced by extracting starch from plants such as corn or potatoes, then refining and drying it to create a fine powder that can be used in a variety of food products.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":996,"name":"脱脂粉乳","vegetarian":"true","created_at":"2024-03-06T12:57:08.869Z","updated_at":"2024-03-06T12:57:13.132Z","vegan":"false","english_name":"skimmed milk powder","english_description":"Skimmed milk powder is produced by evaporating milk to remove the water content, resulting in a concentrated powder. This process involves the use of animal-derived milk, making it not suitable for vegans and those seeking dairy-free alternatives.","pescetarian":"true","dairy_free":"false","peanut_free":"true"},{"id":997,"name":"チーズパウダー","vegetarian":"true","created_at":"2024-03-06T12:57:14.188Z","updated_at":"2024-03-06T12:57:17.775Z","vegan":"false","english_name":"cheese powder","english_description":"Cheese powder is typically made by dehydrating and grinding cheese into a fine powder. This process involves using dairy products, making it not suitable for vegans, vegetarians, pescetarians, those with dairy allergies, and those with peanut allergies.","pescetarian":"true","dairy_free":"false","peanut_free":"can-be"},{"id":998,"name":"水あめ","vegetarian":"false","created_at":"2024-03-06T12:57:19.543Z","updated_at":"2024-03-06T12:57:23.564Z","vegan":"false","english_name":"amen","english_description":"Amen is typically produced using animal-derived ingredients such as gelatin, which makes it not suitable for vegans, vegetarians, and pescetarians. Additionally, it may not be peanut-free or dairy-free depending on the specific ingredients used in the production process.","pescetarian":"can-be","dairy_free":"false","peanut_free":"false"},{"id":1003,"name":"カカオマス","vegetarian":"true","created_at":"2024-03-06T12:58:36.793Z","updated_at":"2024-03-06T12:58:38.829Z","vegan":"true","english_name":"cacao mass","english_description":"Cacao mass is produced by grinding roasted cacao beans into a smooth liquid paste, which contains both cocoa solids and cocoa butter.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":999,"name":"バターパウダー","vegetarian":"true","created_at":"2024-03-06T12:57:56.536Z","updated_at":"2024-03-06T12:58:26.026Z","vegan":"false","english_name":"butter powder","english_description":"Butter powder is produced by dehydrating and pulverizing butter, which is derived from cow's milk, making it not suitable for vegans, vegetarians, pescetarians, those with peanut allergies, and individuals avoiding dairy products.","pescetarian":"true","dairy_free":"false","peanut_free":"can-be"},{"id":1004,"name":"グァー","vegetarian":"true","created_at":"2024-03-06T12:58:40.915Z","updated_at":"2024-03-06T12:58:44.221Z","vegan":"false","english_name":"guar","english_description":"Guar is produced from the guar bean, which is a legume. This means that it is not suitable for those following a vegan, vegetarian, pescetarian, peanut-free, or dairy-free diet as it is derived from a plant source that may not align with their dietary restrictions.","pescetarian":"true","dairy_free":"false","peanut_free":"false"},{"id":1007,"name":"青のり","vegetarian":"true","created_at":"2024-03-06T12:58:53.848Z","updated_at":"2024-03-06T12:58:55.830Z","vegan":"true","english_name":"green laver","english_description":"Green laver, also known as sea lettuce, is produced by harvesting and drying seaweed from the ocean, then grinding it into a fine powder or flakes for culinary use.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1008,"name":"あおさ","vegetarian":"true","created_at":"2024-03-06T12:58:57.779Z","updated_at":"2024-03-06T12:59:00.030Z","vegan":"true","english_name":"aosa (japanese sea lettuce)","english_description":"Aosa, also known as Japanese sea lettuce, is produced through the cultivation of seaweed in the ocean, where it is harvested and dried before being used in various dishes such as soups and salads.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1009,"name":"ほたてエキスパウダー","vegetarian":"can-be","created_at":"2024-03-06T12:59:01.151Z","updated_at":"2024-03-06T12:59:05.558Z","vegan":"false","english_name":"scallop extract powder","english_description":"Scallop extract powder is produced by grinding dried scallops into a fine powder. This process involves the use of animal-derived ingredients, making it not suitable for vegans, vegetarians, pescetarians, and those with peanut or dairy allergies.","pescetarian":"true","dairy_free":"can-be","peanut_free":"can-be"},{"id":1010,"name":"ごま油","vegetarian":"true","created_at":"2024-03-06T12:59:07.827Z","updated_at":"2024-03-06T12:59:10.374Z","vegan":"true","english_name":"sesame oil","english_description":"Sesame oil is produced by extracting oil from sesame seeds through a process of pressing or crushing the seeds to release the oil, which is then filtered and refined to produce a clear, flavorful oil commonly used in cooking and skincare.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1011,"name":"植物油","vegetarian":"true","created_at":"2024-03-06T12:59:11.493Z","updated_at":"2024-03-06T12:59:13.850Z","vegan":"true","english_name":"vegetable oil","english_description":"Vegetable oil is produced through a process of extracting oil from various plant sources such as seeds, nuts, or fruits, which are then refined and processed to create a clear, liquid oil suitable for cooking and other uses.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1012,"name":"こんぶエキスパウダー","vegetarian":"true","created_at":"2024-03-06T12:59:14.980Z","updated_at":"2024-03-06T12:59:17.534Z","vegan":"true","english_name":"kelp extract powder","english_description":"Kelp extract powder is typically produced by drying and grinding kelp seaweed into a fine powder. However, since kelp is a type of seaweed, it may not be considered vegetarian or pescetarian due to its marine origin, and it may not be peanut-free if processed in a facility that also handles peanuts.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":1013,"name":"ご飯","vegetarian":"true","created_at":"2024-03-06T12:59:18.686Z","updated_at":"2024-03-06T12:59:20.913Z","vegan":"true","english_name":"gohan (rice)","english_description":"Gohan, or rice, is produced through a series of steps including planting, growing, harvesting, milling, and polishing to create the final product that is a staple food in many cultures around the world.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1014,"name":"サーモントラウト西京焼","vegetarian":"false","created_at":"2024-03-06T12:59:22.065Z","updated_at":"2024-03-06T12:59:25.726Z","vegan":"false","english_name":"saikyo-yaki salmon trout","english_description":"Saikyo-yaki salmon trout is marinated in a sweet miso paste and then grilled, making it not suitable for vegans or vegetarians due to the use of fish. It is also not pescetarian-friendly as it contains fish, and may not be peanut-free depending on the ingredients in the miso paste.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":1015,"name":"玉子焼","vegetarian":"true","created_at":"2024-03-06T12:59:27.057Z","updated_at":"2024-03-06T12:59:31.444Z","vegan":"false","english_name":"omelette omelet","english_description":"An omelette is typically made by whisking eggs and cooking them with various fillings such as cheese, meat, and vegetables. This production process makes omelettes not suitable for vegans as they contain animal products like eggs and dairy.","pescetarian":"true","dairy_free":"can-be","peanut_free":"true"},{"id":1016,"name":"切干大根煮","vegetarian":"true","created_at":"2024-03-06T12:59:32.557Z","updated_at":"2024-03-06T12:59:34.639Z","vegan":"true","english_name":"kiriboshi daikon","english_description":"Kiriboshi daikon is made by thinly slicing daikon radish, then drying it in the sun until it becomes a light, crunchy texture, which can be used in various Japanese dishes.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1017,"name":"ひじき煮","vegetarian":"true","created_at":"2024-03-06T12:59:35.767Z","updated_at":"2024-03-06T12:59:37.298Z","vegan":"true","english_name":"boiled hijiki","english_description":"Boiled hijiki is produced by soaking the dried seaweed in water to rehydrate it, then boiling it until it is tender and ready to eat.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1018,"name":"がんもどき煮","vegetarian":"false","created_at":"2024-03-06T12:59:38.441Z","updated_at":"2024-03-06T12:59:42.196Z","vegan":"false","english_name":"boiled ganmon doki","english_description":"Boiled ganmon doki is made by boiling a mixture of flour, water, and salt until it forms a sticky dough, which is then shaped into small dumplings and cooked in a broth. The use of flour and water in the dough makes it not vegan as it contains animal-derived ingredients.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1019,"name":"だし入り醤油たれ","vegetarian":"false","created_at":"2024-03-06T12:59:44.426Z","updated_at":"2024-03-06T12:59:48.720Z","vegan":"false","english_name":"dashi iri soy sauce sauce","english_description":"Dashi iri soy sauce is made by combining soy sauce with dashi, a broth made from fish flakes and seaweed. This process makes it unsuitable for vegans, vegetarians, and pescetarians, and potentially not peanut-free due to cross-contamination risks in the production process.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"},{"id":1020,"name":"人参煮","vegetarian":"true","created_at":"2024-03-06T12:59:49.792Z","updated_at":"2024-03-06T12:59:52.124Z","vegan":"true","english_name":"carrot stew","english_description":"Carrot stew is made by sautéing onions, garlic, and carrots in a pot, then adding broth, herbs, and spices before simmering until the carrots are tender and the flavors have melded together.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1021,"name":"れんこん煮漬物","vegetarian":"true","created_at":"2024-03-06T12:59:53.195Z","updated_at":"2024-03-06T12:59:55.009Z","vegan":"true","english_name":"pickled lotus root","english_description":"Pickled lotus root is produced by slicing lotus root into thin rounds, soaking them in a mixture of vinegar, sugar, and salt, and allowing them to ferment for several days before being preserved in jars.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1022,"name":"いんげん","vegetarian":"true","created_at":"2024-03-06T12:59:56.169Z","updated_at":"2024-03-06T12:59:58.803Z","vegan":"true","english_name":"beans","english_description":"Beans are produced by planting bean seeds in the soil, where they grow into plants that produce pods containing the beans. The pods are harvested when they are mature and the beans are then dried and processed for consumption.","pescetarian":"true","dairy_free":"true","peanut_free":"true"},{"id":1023,"name":"ごま","vegetarian":"true","created_at":"2024-03-06T12:59:59.978Z","updated_at":"2024-03-06T13:00:02.589Z","vegan":"true","english_name":"sesame","english_description":"Sesame seeds are produced by harvesting the dried seed pods of the sesame plant, which can sometimes be contaminated with insects or insect parts, making it not suitable for strict vegetarians. Additionally, sesame seeds are often processed in facilities that also handle peanuts, making them potentially unsafe for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"false"},{"id":1024,"name":"増粘剤","vegetarian":"true","created_at":"2024-03-06T13:00:04.597Z","updated_at":"2024-03-06T13:00:07.505Z","vegan":"true","english_name":"thickeners","english_description":"Thickeners are typically produced using animal-derived gelatin or fish-based ingredients, making them unsuitable for vegetarians and pescetarians. Additionally, some thickeners may contain traces of peanuts or be processed in facilities that handle peanuts, posing a risk for those with peanut allergies.","pescetarian":"true","dairy_free":"true","peanut_free":"can-be"}]